app/Controllers/BlogController.php

    public function index()
    {
        $model = new BlogModel();
        $data['blogs'] = $model->orderBy('id', 'DESC')->paginate(5);
---
SELECT *
FROM `blogs`
ORDER BY `id` DESC
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `blogs`

    public function create()
    {
        $model = new BlogModel();

        $model->save([
            'title' => $this->request->getPost('title'),
            'description' => $this->request->getPost('description')
        ]);
---
INSERT INTO `blogs` (`title`, `description`) VALUES ('bdgbgd', 'dgbb')

    public function delete($id)
    {
        $model = new BlogModel();
        $model->delete($id);
---
DELETE FROM `blogs`
WHERE `id` IN ('12')